app/controllers/waitlists_controller.rb

  def index
    @waitlists = Waitlist.all
---
SELECT * FROM "waitlists"

  def show
    @waitlist = Waitlist.find(params[:id])
---
SELECT * FROM "waitlists" WHERE ("waitlists"."id" = 1)

  def edit
    @waitlist = Waitlist.find(params[:id])
---
SELECT * FROM "waitlists" WHERE ("waitlists"."id" = 25)

  def create
    @waitlist = Waitlist.new(params[:waitlist])

    respond_to do |format|
      if @waitlist.save
---
INSERT INTO "waitlists" ("name", "created_at", "updated_at", "phone", "crn", "email") VALUES('Sean', '2010-10-02 10:04:58', '2010-10-02 10:04:58', '2173779203', '51747', 'seanadams9@gmail.com')

  def destroy
    @waitlist = Waitlist.find(params[:id])
    @waitlist.destroy
---
SELECT * FROM "waitlists" WHERE ("waitlists"."id" = 1)
DELETE FROM "waitlists" WHERE "id" = 1